ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
void test_gpio_loopback_pa9_pb7(void)
{
    gpio_lb_init_pa9_pb7();

    /* HIGH */
    gpio_set_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(1, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9=HIGH should read PB7=HIGH — check jumper PA9<->PB7");

    /* LOW */
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9=LOW should read PB7=LOW — check jumper PA9<->PB7");

    /* Toggle HIGH → LOW */
    gpio_toggle_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(1, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9 after toggle: PB7 should be HIGH");

    gpio_toggle_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9 after second toggle: PB7 should be LOW");

    gpio_lb_deinit_pa9_pb7();
}

void test_gpio_loopback_pc6_pc7(void)
{
    gpio_lb_init_pc6_pc7();

    /* HIGH */
    gpio_set_pin(GPIO_PORT_C, 6);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(1, gpio_read_pin(GPIO_PORT_C, 7),
        "PC6=HIGH should read PC7=HIGH — check jumper PC6<->PC7");

    /* LOW */
    gpio_clear_pin(GPIO_PORT_C, 6);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_C, 7),
        "PC6=LOW should read PC7=LOW — check jumper PC6<->PC7");

    gpio_lb_deinit_pc6_pc7();
}

/* ====================================================================
 * EXTI interrupt tests — PA9 output triggers EXTI line 7 (port B, PB7)
 *
 * Strategy: use EXTI_MODE_INTERRUPT so that EXTI->PR is set on each
 * detected edge (the pending register is only updated in interrupt mode).
 * A minimal EXTI9_5_IRQHandler defined here overrides the Default_Handler
 * (infinite loop) weak alias: it increments a volatile counter and clears
 * the pending bit, then returns — allowing the test to observe how many
 * times the handler fired.
 *
 * Timeout guard: spin up to ~1 ms (100 000 cycles at 100 MHz) before
 * declaring a failure — long enough for any reasonable signal path but
 * short enough to avoid a multi-second hang on a disconnected jumper.
 * ==================================================================== */

/* Shared ISR counter — incremented by EXTI9_5_IRQHandler on each fire */
static volatile uint32_t g_exti9_5_count = 0;

/**
 * @brief Minimal EXTI9_5 handler: count the interrupt and clear pending.
 *
 * Overrides the Default_Handler weak alias in startup code.
 * Clears only line 7 (PB7) pending bit; other lines in the [5-9] group
 * are left untouched (none are armed in these tests).
 */
void EXTI9_5_IRQHandler(void)
{
    if (EXTI->PR & (1U << 7)) {
        EXTI->PR = (1U << 7);   /* write 1 to clear */
        g_exti9_5_count++;
    }
}

#define EXTI_LB_TIMEOUT_CYCLES  100000U

/**
 * @brief Spin until g_exti9_5_count exceeds prev_count, or timeout.
 * @return 1 if count increased, 0 on timeout.
 */
static int exti_lb_wait_count(uint32_t prev_count)
{
    uint32_t n = EXTI_LB_TIMEOUT_CYCLES;
    while (n--) {
        if (g_exti9_5_count != prev_count) return 1;
    }
    return 0;
}

void test_exti_both_edges_pb7(void)
{
    gpio_lb_init_pa9_pb7();
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_BOTH,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt(PB7, BOTH) failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Rising edge */
    gpio_set_pin(GPIO_PORT_A, 9);
    int fired_rising = exti_lb_wait_count(prev);
    prev = g_exti9_5_count;

    /* Falling edge */
    gpio_clear_pin(GPIO_PORT_A, 9);
    int fired_falling = exti_lb_wait_count(prev);

    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_lb_deinit_pa9_pb7();

    TEST_ASSERT_MESSAGE(fired_rising,
        "EXTI BOTH: rising edge did not fire — check jumper PA9<->PB7");
    TEST_ASSERT_MESSAGE(fired_falling,
        "EXTI BOTH: falling edge did not fire — check jumper PA9<->PB7");
}

void test_exti_software_trigger_pb7(void)
{
    /* Software trigger: no loopback cable required.
     * Writes to EXTI->SWIER to generate a synthetic rising edge.
     * The EXTI9_5_IRQHandler defined above will fire and increment
     * g_exti9_5_count, confirming end-to-end EXTI machinery works.  */
    gpio_clock_enable(GPIO_PORT_B);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_INPUT);

    /* Enable SYSCFG clock (needed by exti_configure_gpio_interrupt) */
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    /* Configure for rising edge, interrupt mode */
    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_RISING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt for software trigger test failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Fire software trigger */
    int sw_ret = exti_software_trigger(7);
    TEST_ASSERT_EQUAL_MESSAGE(0, sw_ret,
        "exti_software_trigger(7) returned error");

    /* Wait for ISR to fire */
    int fired = exti_lb_wait_count(prev);

    /* Cleanup */
    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_ANALOG);

    TEST_ASSERT_MESSAGE(fired,
        "EXTI software trigger: ISR did not fire");
}

/* ====================================================================
 * Main test runner
 * ==================================================================== */

int run_unity_tests(void) {
    UNITY_BEGIN();

    /* ----------------------------------------------------------
     * Tier 1: Smoke test — all 5 SPIs at max speed
     *   prescaler=2, 256 bytes, polled + DMA
     * ---------------------------------------------------------- */
    printf("\n--- Tier 1: All-SPI smoke (psc=2, 256B) ---\n");
    printf_dma_flush();

    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 0);   /* SPI1 polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 1);   /* SPI1 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 0);   /* SPI2 polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 1);   /* SPI2 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 0);   /* SPI3 polled */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 1);   /* SPI3 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 0);   /* SPI4 polled */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 1);   /* SPI4 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 0);   /* SPI5 polled */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 1);   /* SPI5 DMA    */

    /* ----------------------------------------------------------
     * Tier 2a: Deep sweep — SPI2 (APB1, 50 MHz bus)
     *   Prescaler sweep: 2, 4, 8, 16, 32, 64, 128, 256
     *   Buffer sizes: 1, 4, 16, 64, 256
     *   Both polled and DMA
     *
     *   Full matrix is 8×5×2 = 80 tests. We select a representative
     *   subset: all prescalers at 256B, all sizes at prescaler=2,
     *   plus DMA mirrors. This gives thorough coverage with ~30 tests.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2a: SPI2 (APB1 50MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 2b: Deep sweep — SPI1 (APB2, 100 MHz bus)
     *   Same test matrix structure as SPI2.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2b: SPI1 (APB2 100MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 3: Non-SPI hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 3: FPU tests ---\n");
    printf_dma_flush();

    RUN_TEST(test_fpu_multiplication);
    RUN_TEST(test_fpu_division);

    /* ----------------------------------------------------------
     * Tier 4: RCC and Timer hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 4: RCC clock tree ---\n");
    printf_dma_flush();

    RUN_TEST(test_rcc_sysclk_is_100mhz);
    RUN_TEST(test_rcc_apb1_clk_is_50mhz);
    RUN_TEST(test_rcc_apb2_clk_is_100mhz);
    RUN_TEST(test_rcc_apb1_timer_clk_is_100mhz);

    printf("\n--- Tier 4: Timer delay accuracy ---\n");
    printf_dma_flush();

    RUN_TEST(test_timer_delay_us_accuracy);

    /* ----------------------------------------------------------
     * Tier 5: UART loopback hardware tests
     *   USART1: PA9 (TX/AF7) wired to PB7 (RX/AF7)
     *   USART6: PC6 (TX/AF8) wired to PC7 (RX/AF8)
     *   115200 baud, polled, no DMA/interrupts.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: USART1 loopback (PA9/PB7) ---\n");
    printf_dma_flush();

