ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
    RUN_TEST(test_usart1_loopback_0xa5);
    RUN_TEST(test_usart1_loopback_0x00);
    RUN_TEST(test_usart1_loopback_0xff);
    RUN_TEST(test_usart1_loopback_sequence);

    printf("\n--- Tier 5: USART6 loopback (PC6/PC7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_usart6_loopback_0xa5);
    RUN_TEST(test_usart6_loopback_0x00);
    RUN_TEST(test_usart6_loopback_0xff);
    RUN_TEST(test_usart6_loopback_sequence);

    /* ----------------------------------------------------------
     * Tier 5: GPIO output/input loopback tests
     *   PA9 (output) wired to PB7 (input) — UART1 loopback cable
     *   PC6 (output) wired to PC7 (input) — UART6 loopback cable
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: GPIO loopback ---\n");
    printf_dma_flush();

    RUN_TEST(test_gpio_loopback_pa9_pb7);   /* HIGH, LOW, toggle — PA9<->PB7 */
    RUN_TEST(test_gpio_loopback_pc6_pc7);   /* HIGH, LOW         — PC6<->PC7 */

    /* ----------------------------------------------------------
     * Tier 5: EXTI interrupt tests
     *   PA9 (output) wired to PB7 (input, EXTI line 7 port B)
     *   Both edges tested in one function; software trigger separate.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: EXTI loopback (PA9->PB7, line 7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_exti_both_edges_pb7);
    RUN_TEST(test_exti_software_trigger_pb7);

    printf_dma_flush();
    return UNITY_END();
}

#endif /* HIL_TEST_MODE */
